<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
class AdvantageTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('advantage')->delete();

        \App\Advantage::create(array(
            'name' => '<p>Не горит, устойчив к перепаду температур</p>',
            'text' => ' <h5>Огнестойкость гибкого камня и термопанелей</h5>
                        <p>Экологически чистый материал не горит , не плавится и не поддерживает горение.
                            Результатом воздействия высоких температур на гибкий камень является его размягчение.
                            Температурный диапазон эксплуатации этого материала от -40˚C до +650˚C.
                            Материал с такими характеристиками легко можно использовать как для внутренней, так и для
                            внешней отделки.
                            Защитное покрытие термопанелей на основе мраморной крошки так же не горит , не плавится и не
                            поддерживает горение!
                        </p>',
        ));

        \App\Advantage::create(array(
            'name' => '<p>Легко моется, не впитывает влагу</p>',
            'text' => ' <h5>Легко моется и не впитывает влагу.</h5>
                    <p>Покрытие гибкого камня и термопанелей на основе мраморной крошки и специального эластичного
                        материала отталкивает влагу, в порах поверхности не откладывается придорожная пыль и грязь.
                        Если
                        Вы все же решите помыть этот материал, то это можно сделать даже автомобильной мойкой
                        высокого
                        давления.
                        При направленной струе высокого давления в одну точку материала на расстоянии 10-15 см от
                        него в
                        течение 5-7 минут не нанесут ему никаких повреждений.</p>',
        ));

        \App\Advantage::create(array(
            'name' => ' <p>Устойчив к выцветанию</p>',
            'text' => '   <h5>Устойчив к выцветанию и воздействию прямых солнечных лучей.</h5>
                        <p>Цвет гибкого камня и термопанелей образуется путем окрашивание самой мраморной крошки, а не
                            нанесение красящего материала сверху или смешивания с колерами на водной основе.
                            Окрашивание материала осуществляется специальными пигментами устойчивыми к выцветанию.
                            Например
                            TiO2.</p>',
        ));

        \App\Advantage::create(array(
            'name' => ' <p>Не трескается, высокопрочный</p></p>',
            'text' => '  <h5>Не трескается, устойчив к механическому воздействию.</h5>
                        <p>При монтаже материала швы заделываются эластичной смесью на основе акриловой смолы. Сам
                            декоративный слой состоит из эластичной акриловой смолы наполненной натуральной,
                            обеспыленной
                            мраморной крошкой и комплексом модифицированных добавок. Все это позволяет материалу
                            принимать
                            различную форму и под воздействием усадки фундамента не образуются трещины.
                        </p>',
        ));

        \App\Advantage::create(array(
            'name' => '<p>Перечень других преимуществ</p>',
            'text' => '  <h5>Основные преимущества гибкого камня и термопанелей</h5>
                        <p>
                            - Долговечность. Материал устойчив к воздействиям внешней среды. </br>
                            - Пластичность. Материал, при желании, может принять любую необходимую форму, прикрепиться к
                            - любой поверхности. Простор для творчества и фантазии.</br>
                            - Непревзойденный внешний вид, с текстурой среза натурального песчаника.</br>
                            - Широкая сфера применения: отделка фасада, стен, пола, бассейна, сауны, облицовка каминов и
                            лестниц, создание ландшафтного дизайна и многое другое.</br>
                            - Легкий вес изделия. Для транспортировки можно использовать даже легковой автомобиль.</br>
                            - Натуральный материал, совершенно не опасен для здоровья человека, а также не представляет
                            угрозу для окружающей среды.</br>
                            - Материал можно использовать для нанесения фрески.</br>
                        </p>',
        ));
        $this->command->info('advantage finished');
    }
}
